package java_Bclass.team02;

public class Info {
	/*
	 * 학생 성적 입력 프로그램
	 * 담당 : 학생 정보 삭제 , 학생 정보 수정
	 * 구현
	 * 화면 설계

------------------------------------------------------------------
1. 학생 등록 2. 학생 점수 입력 3. 학생 목록 4. 학생 정보 삭제 5. 학생 정보 수정 6. 종료
------------------------------------------------------------------
메뉴 선택 > 4
삭제할 학생의 이름 >
삭제할 학생의 이름이 ( 이름 ) 이 맞으면 다시 입력, 아니면 0을 입력해주세요.
( 이름 ) 학생의 정보가 삭제되었습니다.

------------------------------------------------------------------
1. 학생 등록 2. 학생 점수 입력 3. 학생 조회 4. 학생 정보 삭제 5. 학생 정보 수정 6. 종료
------------------------------------------------------------------
메뉴 선택 > 5
정보를 수정할 학생의 이름 입력 >
나이 :
수강과목 :
국어 점수 :
수학 점수 :
영어 점수 :

------------------------------------------------------------------
1. 학생 등록 2. 학생 점수 입력 3. 학생 목록 4. 학생 정보 삭제 5. 학생 정보 수정 6. 종료
------------------------------------------------------------------
메뉴 선택 > 6
학원 수강생 관리 프로그램을 종료합니다.

*********************************
학생 정보삭제>
학생 이름 입력-관리자 비밀번호 입력-무작위번호 띄우고, 그 번호 입력/틀리면 맞을 때까지 입력,취소하려면 0번
학생 정보수정>
학생 이름 입력-과목선택/신상정보변경-신청하지 않은 과목이면 '신청하지않은 과목입니다'
계속 수정하시겠습니까 yn
학생 이름도 수정 가능-신상정보변경:이 경우 비고:사유입력

*특정 아이디는 몇개항목 사용 불가능하게 할 수 없나?
*보여주기용 학생 명단 잘 짜야할 듯:abc성적 보여줄 수 있게/과목 선택 가능하다는 것/비고 사유/성적 수정했더니 반 옮길 수 있게
*
*
	 */
}
