
public class Info {
	
/*11.1 예외와 예외 클래스
 *
 *에러 : 불가항력 / 갑자기 전원이 꺼진다 등등
 *예외 : 데이터, 입력 등 잘못됨 -> 예측 가능, 처리할 수 있음(정상실행으로 돌릴 수 있음)
 *
 *예외 종류 2가지
 *일반예외(Exception) : 컴파일러가 예측한 예외, 코드 작성 시 알 수 있음
 *실행예외(Runtime Exception) : 실행 후 알 수 있음(경험에 의해 예외처리 해야함)
 *
 *예외객체를 이용해 예외를 처리한다(자바 언어로 다 규정되어있음 Exception, ClassNotFoundException 등등) 
 *
 *p464 그림 참고
 *Trowable : 예외가 발생하면 던져버린다(실제 부모라기 보다는 개념적 의미)
 *Exception: 일반예외 클래스들의 부모
 *Runtime Exception : 실행예외, Exception의 자식 중 하나, 일반예외와 다르게 컴파일러가 예측하지 못한다.
 */
}
